package com.ssc.namespring.study

class Day4 {
    // 3. 요구사항 추출
    // - 사용자 시나리오 상상, 시나리오(사용 흐름) 설명
    //   - 여기서 부터 UI를 어떻게 해야 될지 보이기 시작함
    // - 시나리오 정리하면서 사용자에게 필요한 단위 요구 기능이 추출됨

    // 4. UI 스케치 시작
    // 숙제: due: 화까지 해오기
    // 1. 스플래시 액티비티 추가하기
    // - 앱 실행 시 1초동안 액티비티가 잠깐 로고만 띄워주는 형태
    // - 1초 후 액티비티가 메인으로 전환됨 (기능 매우 간단. gpt한테 설명해주면 코드 알아서 해줌)
    // - 스플래시 액티비의 중앙에는 원형 로고가 나옴. (logo_1)
    // 2. 아이콘 변경하기
    // - squarcle 형태 아이콘: logo_2번 쓰기.
    // * 참고:
    // AI 누끼따기 웹사이트 찾아서 로고 배경 지우면 될듯.

    // (로직 코틀린으로 짜기: due:06.26일 )
}